## JSON

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = '{"Employee Name":"James Mathew","Email ID":"james.mathew@company.com","Job Title":[{"Title1":"Team Lead","Title2":"Software Developer"}]}'
df1=pd.read_json(data)

In [3]:
df = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data',header=None)

In [4]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

In [5]:
df1.to_json(orient='records')

'[{"Employee Name":"James Mathew","Email ID":"james.mathew@company.com","Job Title":{"Title1":"Team Lead","Title2":"Software Developer"}}]'

## HTML

In [6]:
url = 'https://en.wikipedia.org/wiki/Mobile_country_code'
df = pd.read_html(url,match='Country',header=0)

In [8]:
df[0].head()

,Mobile country code,Country,ISO 3166,Mobile network codes,National MNC authority,Remarks
0,289,A Abkhazia,GE-AB,List of mobile network codes in Abkhazia,NaN,MCC is not listed by ITU
1,412,Afghanistan,AF,List of mobile network codes in Afghanistan,NaN,NaN
2,276,Albania,AL,List of mobile network codes in Albania,NaN,NaN
3,603,Algeria,DZ,List of mobile network codes in Algeria,NaN,NaN
4,544,American Samoa (United States of America),AS,List of mobile network codes in American Samoa,NaN,NaN

## Pickling

In [14]:
d = pd.DataFrame([[1,2,3,4,5],[6,7,8,9,10],[11,12,13,14,15],[16,17,18,19,20],[21,22,23,24,25]],columns=['a','b','c','d','e'])

In [15]:
d

    a   b   c   d   e
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15
3  16  17  18  19  20
4  21  22  23  24  25

In [25]:
d.to_excel('d_excel.xlsx',index=False)

In [27]:
df = pd.read_excel('d_excel.xlsx')

In [28]:
df.to_pickle('d1_excel')

In [29]:
d2= pd.read_pickle('d1_excel')

In [30]:
d2

    a   b   c   d   e
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15
3  16  17  18  19  20
4  21  22  23  24  25